In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:easwari@localhost

In [3]:
%%sql
use `joins`;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [4]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost
17 rows affected.

[('customers',),
 ('departments',),
 ('employees',),
 ('employees1',),
 ('employees2',),
 ('numbers',),
 ('numbers2',),
 ('orders',),
 ('productdelivery',),
 ('products',),
 ('regions',),
 ('salaries',),
 ('students',),
 ('table-a',),
 ('table-b',),
 ('table1',),
 ('table2',)]

In [7]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Janani'), (2, 'Lavanya'), (3, 'Jaanu'), (4, 'Lakshith'), (5, 'Sanjana')]

In [15]:
%%sql
select * from departments;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'HR'), (2, 'Finance'), (3, 'IT'), (4, 'Marketing'), (5, 'Sales')]

In [10]:
%%sql
select * from salaries;

 * mysql+pymysql://root:***@localhost
16 rows affected.

[(1, 60000, datetime.date(2023, 1, 1)),
 (1, 61000, datetime.date(2023, 2, 1)),
 (1, 62000, datetime.date(2023, 3, 1)),
 (1, 63000, datetime.date(2023, 4, 1)),
 (1, 64000, datetime.date(2023, 5, 1)),
 (2, 65000, datetime.date(2023, 1, 1)),
 (2, 66000, datetime.date(2023, 2, 1)),
 (2, 67000, datetime.date(2023, 3, 1)),
 (2, 68000, datetime.date(2023, 4, 1)),
 (2, 69000, datetime.date(2023, 5, 1)),
 (3, 70000, datetime.date(2023, 1, 1)),
 (3, 71000, datetime.date(2023, 2, 1)),
 (3, 72000, datetime.date(2023, 3, 1)),
 (3, 73000, datetime.date(2023, 4, 1)),
 (3, 74000, datetime.date(2023, 5, 1)),
 (3, 90000, datetime.date(2024, 1, 1))]

In [12]:
%%sql
desc departments;

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('dept_no', 'int', 'NO', 'PRI', None, ''),
 ('dept_name', 'varchar(30)', 'YES', '', None, '')]

In [13]:
%%sql
alter table departments
rename column dept_no to emp_no;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [14]:
%%sql
desc departments;

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('emp_no', 'int', 'NO', 'PRI', None, ''),
 ('dept_name', 'varchar(30)', 'YES', '', None, '')]

In [17]:
%%sql
select e.*, d.*
from (employees as e) inner join (departments as d)
on e.emp_no = d.emp_no;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Janani', 1, 'HR'),
 (2, 'Lavanya', 2, 'Finance'),
 (3, 'Jaanu', 3, 'IT'),
 (4, 'Lakshith', 4, 'Marketing'),
 (5, 'Sanjana', 5, 'Sales')]

In [18]:
%%sql
select e.emp_no,e.emp_name,d.dept_name
from (employees as e) inner join (departments as d)
on e.emp_no = d.emp_no;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Janani', 'HR'),
 (2, 'Lavanya', 'Finance'),
 (3, 'Jaanu', 'IT'),
 (4, 'Lakshith', 'Marketing'),
 (5, 'Sanjana', 'Sales')]

In [19]:
%%sql
select e.*, d.*
from (employees as e) inner join (departments as d)
on e.emp_no = d.emp_no;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Janani', 1, 'HR'),
 (2, 'Lavanya', 2, 'Finance'),
 (3, 'Jaanu', 3, 'IT'),
 (4, 'Lakshith', 4, 'Marketing'),
 (5, 'Sanjana', 5, 'Sales')]

In [20]:
%%sql
select e.*,d.*,s.*
from (employees as e) inner join (departments as d)
on e.emp_no = d.emp_no 
inner join (salaries as s) 
on e.emp_no = s.emp_no;

 * mysql+pymysql://root:***@localhost
16 rows affected.

[(1, 'Janani', 1, 'HR', 1, 60000, datetime.date(2023, 1, 1)),
 (1, 'Janani', 1, 'HR', 1, 61000, datetime.date(2023, 2, 1)),
 (1, 'Janani', 1, 'HR', 1, 62000, datetime.date(2023, 3, 1)),
 (1, 'Janani', 1, 'HR', 1, 63000, datetime.date(2023, 4, 1)),
 (1, 'Janani', 1, 'HR', 1, 64000, datetime.date(2023, 5, 1)),
 (2, 'Lavanya', 2, 'Finance', 2, 65000, datetime.date(2023, 1, 1)),
 (2, 'Lavanya', 2, 'Finance', 2, 66000, datetime.date(2023, 2, 1)),
 (2, 'Lavanya', 2, 'Finance', 2, 67000, datetime.date(2023, 3, 1)),
 (2, 'Lavanya', 2, 'Finance', 2, 68000, datetime.date(2023, 4, 1)),
 (2, 'Lavanya', 2, 'Finance', 2, 69000, datetime.date(2023, 5, 1)),
 (3, 'Jaanu', 3, 'IT', 3, 70000, datetime.date(2023, 1, 1)),
 (3, 'Jaanu', 3, 'IT', 3, 71000, datetime.date(2023, 2, 1)),
 (3, 'Jaanu', 3, 'IT', 3, 72000, datetime.date(2023, 3, 1)),
 (3, 'Jaanu', 3, 'IT', 3, 73000, datetime.date(2023, 4, 1)),
 (3, 'Jaanu', 3, 'IT', 3, 74000, datetime.date(2023, 5, 1)),
 (3, 'Jaanu', 3, 'IT', 3, 90000, datetime.date(2024, 1, 1))]